Revit 2027 API
OptionalFunctionalityUtils.IsIFCAvailable Method
 Checks whether IFC functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsIFCAvailable()
Public Shared Function IsIFCAvailable As Boolean
public:
static bool IsIFCAvailable()
static member IsIFCAvailable : unit -> bool
Return Value
Boolean
 True if the IFC functionality is available in the installed Revit.
Remarks
 IFC Import/Export requires presence of certain modules that are optional and may not be part of the installed Revit.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace